dotbins.org
#+SETUPFILE: ./export.setup

#+TITLE: Utility Programs (.bin)
#+PROPERTY: header-args       :tangle-mode (identity #o755)
#+PROPERTY: header-args+      :mkdirp yes
#+PROPERTY: tangle-target-dir .files

