dotbins.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge599bba">Declutters</a></li>
<li><a href="#org78418ac">Database back-up scripts</a></li>
<li><a href="#orgaa64b51">Snapshots taking</a></li>
<li><a href="#org8746cbe">backup scripts</a></li>
<li><a href="#org587e947">filetype</a></li>
<li><a href="#org6ac51e4">mediautil</a></li>
<li><a href="#org9996d96">genalbum</a></li>
<li><a href="#orgd76e9f1">nhp</a></li>
<li><a href="#org2bbb8e2">sendmail.py</a></li>
<li><a href="#org7633708">pwsudo</a></li>
<li><a href="#org8efcac8">gitsync</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge599bba" class="outline-2">
<h2 id="orge599bba">Declutters</h2>
<div class="outline-text-2" id="text-orge599bba">
<p>
These scripts (declutter<sub>xxx</sub>) keep things decluttered.
</p>

<ul class="org-ul">
<li><p>
trash
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/env python3</span>

<span style="font-weight: bold;">import</span> os
<span style="font-weight: bold;">import</span> time
<span style="font-weight: bold;">import</span> datetime
<span style="font-weight: bold;">import</span> shutil
<span style="font-weight: bold;">import</span> glob
<span style="font-weight: bold;">from</span> send2trash <span style="font-weight: bold;">import</span> send2trash

<span style="font-weight: bold; font-style: italic;">TRASH_DIR</span> = os.environ[<span style="font-style: italic;">'HOME'</span>] + <span style="font-style: italic;">'/.local/share/Trash/files/'</span>
<span style="font-weight: bold; font-style: italic;">TIDY_DIRS</span> = <span style="font-weight: bold;">filter</span>(<span style="font-weight: bold;">lambda</span> x: os.path.isdir(x),
                   <span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">lambda</span> x: os.path.join(os.environ[<span style="font-style: italic;">'HOME'</span>], x), [<span style="font-style: italic;">'tmp'</span>, <span style="font-style: italic;">'Downloads'</span>]))
                   + glob.glob(os.path.join(os.environ[<span style="font-style: italic;">'HOME'</span>], <span style="font-style: italic;">'var/tmp/*'</span>)))

<span style="font-weight: bold; font-style: italic;">MAX_STAY_DAYS_IN_TRASH</span> = 7
<span style="font-weight: bold; font-style: italic;">MAX_NEGLECTED_DAYS_IN_TIDY_DIRS</span> = 14

<span style="font-weight: bold; font-style: italic;">suffixes</span> = [<span style="font-style: italic;">'B'</span>, <span style="font-style: italic;">'KB'</span>, <span style="font-style: italic;">'MB'</span>, <span style="font-style: italic;">'GB'</span>, <span style="font-style: italic;">'TB'</span>, <span style="font-style: italic;">'PB'</span>]
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">humansize</span>(nbytes):
    <span style="font-weight: bold; font-style: italic;">i</span> = 0
    <span style="font-weight: bold;">while</span> nbytes &gt;= 1024 <span style="font-weight: bold;">and</span> i &lt; <span style="font-weight: bold;">len</span>(suffixes)-1:
        <span style="font-weight: bold; font-style: italic;">nbytes</span> /= 1024.
        <span style="font-weight: bold; font-style: italic;">i</span> += 1
    <span style="font-weight: bold; font-style: italic;">f</span> = (<span style="font-style: italic;">'%.2f'</span> % nbytes).rstrip(<span style="font-style: italic;">'0'</span>).rstrip(<span style="font-style: italic;">'.'</span>)
    <span style="font-weight: bold;">return</span> <span style="font-style: italic;">'%s %s'</span> % (f, suffixes[i])

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_size</span>(start_path = <span style="font-style: italic;">'.'</span>):
    <span style="font-weight: bold; font-style: italic;">total_size</span> = 0
    <span style="font-weight: bold;">for</span> dirpath, dirnames, filenames <span style="font-weight: bold;">in</span> os.walk(start_path):
        <span style="font-weight: bold;">for</span> f <span style="font-weight: bold;">in</span> filenames:
            <span style="font-weight: bold; font-style: italic;">fp</span> = os.path.join(dirpath, f)
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">skip if it is symbolic link</span>
            <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> os.path.islink(fp):
                <span style="font-weight: bold; font-style: italic;">total_size</span> += os.path.getsize(fp)

    <span style="font-weight: bold;">return</span> total_size

<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'{0} starts at {1}\n'</span>.<span style="font-weight: bold;">format</span>(os.path.basename(__file__),
                                   datetime.datetime.now()))

<span style="font-weight: bold; font-style: italic;">NOW</span> = time.time()

<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'--{0} starts to move files neglected more than {1} days to trash box.\n'</span>
      .<span style="font-weight: bold;">format</span>(os.path.basename(__file__),
              MAX_NEGLECTED_DAYS_IN_TIDY_DIRS))

<span style="font-weight: bold; font-style: italic;">tidyup_lists</span> = <span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">lambda</span> x: <span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">lambda</span> y: os.path.join(x, y), os.listdir(x)), TIDY_DIRS)
<span style="font-weight: bold;">for</span> a_file <span style="font-weight: bold;">in</span> [item <span style="font-weight: bold;">for</span> sublist <span style="font-weight: bold;">in</span> tidyup_lists <span style="font-weight: bold;">for</span> item <span style="font-weight: bold;">in</span> sublist]:
    <span style="font-weight: bold; font-style: italic;">atime</span> = os.lstat(a_file).st_atime
    <span style="font-weight: bold; font-style: italic;">delta_atime</span> = datetime.timedelta(seconds=(NOW - atime))
    <span style="font-weight: bold;">if</span> delta_atime &gt; datetime.timedelta(days = MAX_NEGLECTED_DAYS_IN_TIDY_DIRS):
        <span style="font-weight: bold;">try</span>:
            send2trash(a_file)
        <span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">OSError</span> <span style="font-weight: bold;">as</span> error:
            <span style="font-weight: bold;">print</span>(error)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'moveed to trash: {}'</span>.<span style="font-weight: bold;">format</span>(a_file))

<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'--{0} starts to remove files staying more than {1} days in trash box.'</span>
      .<span style="font-weight: bold;">format</span>(os.path.basename(__file__),
              MAX_STAY_DAYS_IN_TRASH))

<span style="font-weight: bold; font-style: italic;">rbytes_total</span> = 0
<span style="font-weight: bold;">for</span> trash_file <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">lambda</span> fname: os.path.join(TRASH_DIR, fname), os.listdir(TRASH_DIR)):
    <span style="font-weight: bold; font-style: italic;">lstat</span> = os.lstat(trash_file)
    <span style="font-weight: bold; font-style: italic;">delta_time</span> = datetime.timedelta(seconds=(NOW - <span style="font-weight: bold;">max</span>(lstat.st_atime, lstat.st_ctime)))
    <span style="font-weight: bold;">if</span> delta_time &gt; datetime.timedelta(days = MAX_STAY_DAYS_IN_TRASH):
        <span style="font-weight: bold; font-style: italic;">method</span> = <span style="font-style: italic;">'removed'</span>
        <span style="font-weight: bold; font-style: italic;">fname</span> = os.path.basename(trash_file)
        <span style="font-weight: bold;">if</span> os.path.islink(trash_file):
            <span style="font-weight: bold; font-style: italic;">method</span> = <span style="font-style: italic;">'unlinked'</span>
            <span style="font-weight: bold; font-style: italic;">fsize</span> = <span style="font-style: italic;">'N/A'</span>
            os.unlink(trash_file)
        <span style="font-weight: bold;">elif</span> os.path.isfile(trash_file):
            <span style="font-weight: bold; font-style: italic;">rbytes</span> = os.path.getsize(trash_file)
            <span style="font-weight: bold; font-style: italic;">rbytes_total</span> += rbytes
            <span style="font-weight: bold; font-style: italic;">fsize</span> = humansize(rbytes)
            os.remove(trash_file)
        <span style="font-weight: bold;">elif</span> os.path.isdir(trash_file):
            <span style="font-weight: bold; font-style: italic;">rbytes</span> = get_size(trash_file)
            <span style="font-weight: bold; font-style: italic;">rbytes_total</span> += rbytes
            <span style="font-weight: bold; font-style: italic;">fsize</span> = humansize(rbytes)
            <span style="font-weight: bold; font-style: italic;">fname</span> += <span style="font-style: italic;">'/'</span>
            shutil.rmtree(trash_file)
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'{}: [{:&gt;9}] {}'</span>.<span style="font-weight: bold;">format</span>(method, fsize, fname))

<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'--{0} removes [{1}] in total.\n'</span>
      .<span style="font-weight: bold;">format</span>(os.path.basename(__file__),
              humansize(rbytes_total)))

<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'{0} ends at {1}\n'</span>.<span style="font-weight: bold;">format</span>(os.path.basename(__file__),
                                 datetime.datetime.now()))
</pre>
</div></li>
<li><p>
home directory (ruby implementation)
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/env ruby</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">coding: utf-8</span>

<span style="font-weight: bold; text-decoration: underline;">TRASHES</span> = [<span style="font-style: italic;">"*~"</span>, <span style="font-style: italic;">"#*#"</span>, <span style="font-style: italic;">".#*#"</span>, <span style="font-style: italic;">"._*"</span>, <span style="font-style: italic;">".DS_Store"</span>]

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Sweep</span>
  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">sweep</span>(base_dir)
    <span style="font-weight: bold;">puts</span> base_dir
    <span style="font-weight: bold; text-decoration: underline;">TRASHES</span>.each <span style="font-weight: bold;">do</span> |trash|
      tfiles = <span style="font-weight: bold; text-decoration: underline;">File</span>.join(<span style="font-style: italic;">"%s/**"</span> % base_dir, trash)
      <span style="font-weight: bold; text-decoration: underline;">Dir</span>.glob(tfiles).each <span style="font-weight: bold;">do</span> |f|
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold; text-decoration: underline;">File</span>.delete(f) &gt; 0
          <span style="font-weight: bold;">puts</span> <span style="font-style: italic;">"Removed: "</span> + f
        <span style="font-weight: bold;">else</span>
          <span style="font-weight: bold;">puts</span> <span style="font-style: italic;">"CANNOT Removed: "</span> + f
        <span style="font-weight: bold;">end</span>
      <span style="font-weight: bold;">end</span>
    <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>

<span style="font-weight: bold; text-decoration: underline;">ARGV</span>.each <span style="font-weight: bold;">do</span> |arg|
  <span style="font-weight: bold;">if</span> <span style="font-weight: bold; text-decoration: underline;">Dir</span>.exist?(arg) <span style="font-weight: bold;">then</span>
    <span style="font-weight: bold; text-decoration: underline;">Sweep</span>.sweep(arg)
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div></li>
<li><p>
home directory (python implementation)
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/env python3</span>

<span style="font-weight: bold;">import</span> sys
<span style="font-weight: bold;">import</span> os
<span style="font-weight: bold;">import</span> glob
<span style="font-weight: bold;">import</span> argparse

<span style="font-weight: bold; font-style: italic;">TRASH_REGEXPS</span> = [<span style="font-style: italic;">"*~"</span>, <span style="font-style: italic;">"#*"</span>, <span style="font-style: italic;">".#*"</span>, <span style="font-style: italic;">"._*"</span>, <span style="font-style: italic;">".DS_Store"</span>, <span style="font-style: italic;">"*.dvi"</span>, <span style="font-style: italic;">"*.aux"</span>, <span style="font-style: italic;">"*.bbl"</span>]

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Sweepy</span>:
    <span style="font-weight: bold; text-decoration: underline;">@classmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sweep_with_regexp</span>(<span style="font-weight: bold;">self</span>, base_dir, recursive=<span style="font-weight: bold; text-decoration: underline;">False</span>):
        <span style="font-weight: bold;">for</span> trash_regexp <span style="font-weight: bold;">in</span> TRASH_REGEXPS:
            <span style="font-weight: bold; font-style: italic;">files</span> = glob.glob(<span style="font-style: italic;">"%s/**/"</span> % base_dir + trash_regexp, recursive=recursive)
            <span style="font-weight: bold;">for</span> <span style="font-weight: bold;">file</span> <span style="font-weight: bold;">in</span> files:
                <span style="font-weight: bold;">if</span> os.path.isfile(<span style="font-weight: bold;">file</span>):
                    os.remove(<span style="font-weight: bold;">file</span>)
                    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Removed: "</span> + <span style="font-weight: bold;">file</span>)
    <span style="font-weight: bold; text-decoration: underline;">@classmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sweep_broken_symlink</span>(<span style="font-weight: bold;">self</span>, base_dir, recursive=<span style="font-weight: bold; text-decoration: underline;">False</span>):
        <span style="font-weight: bold; font-style: italic;">files</span> = glob.glob(<span style="font-style: italic;">"%s/*"</span> % base_dir, recursive=recursive)
        <span style="font-weight: bold; font-style: italic;">dotfiles</span> = glob.glob(<span style="font-style: italic;">"%s/.*"</span> % base_dir, recursive=recursive)
        <span style="font-weight: bold;">for</span> <span style="font-weight: bold;">file</span> <span style="font-weight: bold;">in</span> (files + dotfiles):
            <span style="font-weight: bold;">if</span> os.path.islink(<span style="font-weight: bold;">file</span>):
                <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> os.path.exists(os.readlink(<span style="font-weight: bold;">file</span>)):
                    os.unlink(<span style="font-weight: bold;">file</span>)
                    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Unlinked: "</span> + <span style="font-weight: bold;">file</span>)

<span style="font-weight: bold; font-style: italic;">parser</span> = argparse.ArgumentParser(description=<span style="font-style: italic;">'Removes all desired files'</span>)
parser.add_argument(<span style="font-style: italic;">'dir'</span>, metavar=<span style="font-style: italic;">'dir'</span>, nargs=<span style="font-style: italic;">'?'</span>, action=<span style="font-style: italic;">'store'</span>,
                    <span style="font-weight: bold;">help</span>=<span style="font-style: italic;">'base directory to search'</span>)
parser.add_argument(<span style="font-style: italic;">'-r'</span>, dest=<span style="font-style: italic;">'recursive'</span>, action=<span style="font-style: italic;">"store_true"</span>, default=<span style="font-weight: bold; text-decoration: underline;">False</span>)
<span style="font-weight: bold; font-style: italic;">args</span> = parser.parse_args()
<span style="font-weight: bold;">if</span> args.recursive:
    Sweepy.sweep_with_regexp(args.<span style="font-weight: bold;">dir</span>, recursive=<span style="font-weight: bold; text-decoration: underline;">True</span>)
    Sweepy.sweep_broken_symlink(args.<span style="font-weight: bold;">dir</span>, recursive=<span style="font-weight: bold; text-decoration: underline;">True</span>)
<span style="font-weight: bold;">else</span>:
    Sweepy.sweep_with_regexp(args.<span style="font-weight: bold;">dir</span>, recursive=<span style="font-weight: bold; text-decoration: underline;">False</span>)
    Sweepy.sweep_broken_symlink(args.<span style="font-weight: bold;">dir</span>, recursive=<span style="font-weight: bold; text-decoration: underline;">False</span>)
</pre>
</div></li>
</ul>
</div>
</div>
