dotbins.html
<div id="outline-container-org78418ac" class="outline-2">
<h2 id="org78418ac">Database back-up scripts</h2>
<div class="outline-text-2" id="text-org78418ac">
<ul class="org-ul">
<li><p>
PostgreSQL
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Usage: $ postgres_backup &lt;db_name&gt; &lt;backup_dir&gt;</span>

<span style="font-weight: bold; font-style: italic;">POSTGRES_DBNAME</span>=$<span style="font-weight: bold; font-style: italic;">1</span>
<span style="font-weight: bold; font-style: italic;">BACKUP_DIR</span>=$<span style="font-weight: bold; font-style: italic;">2</span>
<span style="font-weight: bold; font-style: italic;">DATE</span>=<span style="font-style: italic;">"$(date +%Y%m%d_%H%M)"</span>

pg_dump --format=custom ${<span style="font-weight: bold; font-style: italic;">POSTGRES_DBNAME</span>} &gt; ${<span style="font-weight: bold; font-style: italic;">BACKUP_DIR</span>}/${<span style="font-weight: bold; font-style: italic;">DATE</span>}_${<span style="font-weight: bold; font-style: italic;">POSTGRES_DBNAME</span>}.custom || <span style="font-weight: bold;">exit</span> 1

<span style="font-weight: bold;">exit</span> 0
</pre>
</div></li>

<li><p>
MySQL
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>

<span style="font-weight: bold; font-style: italic;">BACKUP_DIR</span>=~/var/backups/mysql
<span style="font-weight: bold; font-style: italic;">RAW_SQL</span>=<span style="font-style: italic;">"$(date +%Y%m%d_%H%M)_backup.sql"</span>
<span style="font-weight: bold; font-style: italic;">TAR_SQL</span>=<span style="font-style: italic;">"${RAW_SQL}.txz"</span>

(
  <span style="font-weight: bold;">cd</span> <span style="font-style: italic;">"${BACKUP_DIR}"</span> || <span style="font-weight: bold;">exit</span> 1
  mysqldump --opt --all-databases --events --default-character-set=binary -u root &gt; <span style="font-style: italic;">"${RAW_SQL}"</span>
  tar cfJ <span style="font-style: italic;">"${TAR_SQL}"</span> <span style="font-style: italic;">"${RAW_SQL}"</span>
  rm -f <span style="font-style: italic;">"${RAW_SQL}"</span>
) || <span style="font-weight: bold;">exit</span> 1

<span style="font-weight: bold;">exit</span> 0
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgaa64b51" class="outline-2">
<h2 id="orgaa64b51">Snapshots taking</h2>
<div class="outline-text-2" id="text-orgaa64b51">
<ul class="org-ul">
<li><p>
snapshot.sh
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>

<span style="font-weight: bold; font-style: italic;">DATETIME</span>=<span style="font-weight: bold;">`date "+%Y%m%d-%H%M"`</span>
<span style="font-weight: bold; font-style: italic;">BTRFS_MNT</span>=<span style="font-style: italic;">"/mnt/ssd01"</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">take a snapshot in btrfs</span>
<span style="font-weight: bold;">if</span> mountpoint ${<span style="font-weight: bold; font-style: italic;">BTRFS_MNT</span>} &gt;/dev/null 2&gt;&amp;1; <span style="font-weight: bold;">then</span>
  btrfs subvolume snapshot <span style="font-style: italic;">"${BTRFS_MNT}/doc"</span> <span style="font-style: italic;">"${BTRFS_MNT}/snapshots/doc-${DATETIME}"</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div></li>
</ul>
</div>
</div>
