dotbins.html
<div id="outline-container-org8746cbe" class="outline-2">
<h2 id="org8746cbe">backup scripts</h2>
<div class="outline-text-2" id="text-org8746cbe">
<ul class="org-ul">
<li><p>
back<sub>btrfs.sh</sub>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>

<span style="font-weight: bold; font-style: italic;">src_dev</span>=/mnt/ssd01
<span style="font-weight: bold; font-style: italic;">src_snap_dir</span>=<span style="font-style: italic;">"${src_dev}"</span>/snapshots
<span style="font-weight: bold; font-style: italic;">src_back_dir</span>=<span style="font-style: italic;">"${src_dev}"</span>/backups
<span style="font-weight: bold; font-style: italic;">dst_dev</span>=/mnt/hdd01
<span style="font-weight: bold; font-style: italic;">dst_back_dir</span>=<span style="font-style: italic;">"${dst_dev}"</span>/backups

<span style="font-weight: bold; font-style: italic;">parent</span>=$(ls -d <span style="font-style: italic;">"${src_back_dir}"</span>/doc-* 2&gt;/dev/null | sort | tail -1 | xargs basename)
<span style="font-weight: bold; font-style: italic;">snap_earliest</span>=$(ls -d <span style="font-style: italic;">"${src_snap_dir}"</span>/doc-* 2&gt;/dev/null | sort | head -1 | xargs basename)
<span style="font-weight: bold; font-style: italic;">snap_latest</span>=$(ls -d <span style="font-style: italic;">"${src_snap_dir}"</span>/doc-* 2&gt;/dev/null | sort | tail -1 | xargs basename)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">backup root snapshot if nothing exists</span>
<span style="font-weight: bold;">if</span> [ -z <span style="font-style: italic;">"${parent}"</span> ] &amp;&amp; [ -n <span style="font-style: italic;">"${snap_earliest}"</span> ]; <span style="font-weight: bold;">then</span>
  btrfs subvolume snapshot -r <span style="font-style: italic;">"${src_snap_dir}/${snap_earliest}"</span> <span style="font-style: italic;">"${src_back_dir}/${snap_earliest}"</span>
  pwsudo btrfs send <span style="font-style: italic;">"${src_back_dir}/${snap_earliest}"</span> | sudo btrfs receive <span style="font-style: italic;">"${dst_back_dir}"</span>
  <span style="font-weight: bold; font-style: italic;">parent</span>=<span style="font-style: italic;">"${snap_earliest}"</span>
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">backup latest snapshot by sending differential data</span>
<span style="font-weight: bold;">if</span> [ -n <span style="font-style: italic;">"${parent}"</span> ] &amp;&amp; [[ <span style="font-style: italic;">"${parent}"</span> &lt; <span style="font-style: italic;">"${snap_latest}"</span> ]]; <span style="font-weight: bold;">then</span>
  btrfs subvolume snapshot  -r <span style="font-style: italic;">"${src_snap_dir}/${snap_latest}"</span> <span style="font-style: italic;">"${src_back_dir}/${snap_latest}"</span>
  pwsudo btrfs send -p <span style="font-style: italic;">"${src_back_dir}/${parent}"</span> <span style="font-style: italic;">"${src_back_dir}/${snap_latest}"</span> | sudo btrfs receive <span style="font-style: italic;">"${dst_back_dir}"</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div></li>
<li><p>
back<sub>rsync.sh</sub>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>

<span style="font-weight: bold; font-style: italic;">OPT</span>=<span style="font-style: italic;">"-aPh"</span>
<span style="font-weight: bold; font-style: italic;">LINK</span>=<span style="font-style: italic;">"--link-dest=../last/"</span>
<span style="font-weight: bold; font-style: italic;">DEST</span>=<span style="font-style: italic;">"ns01:~/share/backups"</span>
<span style="font-weight: bold; font-style: italic;">DATETIME</span>=<span style="font-weight: bold;">`date "+%Y%m%d-%H%M"`</span>

ssh -q -o <span style="font-weight: bold; font-style: italic;">BatchMode</span>=<span style="font-style: italic;">"yes"</span> -o <span style="font-weight: bold; font-style: italic;">ConnectTimeout</span>=10 ns01 <span style="font-style: italic;">"(cd ~/share/backups; mkdir -p pc01 sv04; exit)"</span> || <span style="font-weight: bold;">exit</span> 1

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">take a snapshot for pc01</span>
<span style="font-weight: bold;">if</span> ssh ns01 <span style="font-style: italic;">"[ -h ~/share/backups/pc01/last ]"</span>; <span style="font-weight: bold;">then</span>
  rsync -aPhrv $<span style="font-weight: bold; font-style: italic;">LINK</span> --exclude-from=${<span style="font-weight: bold; font-style: italic;">HOME</span>}/.config/rsync/exclude_pc01.txt ${<span style="font-weight: bold; font-style: italic;">HOME</span>}/ ${<span style="font-weight: bold; font-style: italic;">DEST</span>}/pc01/${<span style="font-weight: bold; font-style: italic;">DATETIME</span>}
  ssh ns01 <span style="font-style: italic;">"(cd share/backups/pc01; unlink last; ln -s ${DATETIME} last)"</span>
<span style="font-weight: bold;">else</span>
  rsync -aAXrv --exclude-from=${<span style="font-weight: bold; font-style: italic;">HOME</span>}/.config/rsync/exclude_pc01.txt ${<span style="font-weight: bold; font-style: italic;">HOME</span>}/ ${<span style="font-weight: bold; font-style: italic;">DEST</span>}/pc01/${<span style="font-weight: bold; font-style: italic;">DATETIME</span>}
  ssh ns01 <span style="font-style: italic;">"(cd share/backups/pc01; ln -s ${DATETIME} last)"</span>
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">take a snapshot for sv04</span>
<span style="font-weight: bold;">if</span> mountpoint /mnt/sv04 &gt;/dev/null 2&gt;&amp;1; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold;">if</span> ssh ns01 <span style="font-style: italic;">"[ -h ~/share/backups/sv04/last ]"</span>; <span style="font-weight: bold;">then</span>
    rsync -aPhrv $<span style="font-weight: bold; font-style: italic;">LINK</span> --exclude-from=${<span style="font-weight: bold; font-style: italic;">HOME</span>}/.config/rsync/exclude_sv04.txt /mnt/sv04/ ${<span style="font-weight: bold; font-style: italic;">DEST</span>}/sv04/${<span style="font-weight: bold; font-style: italic;">DATETIME</span>}
    ssh ns01 <span style="font-style: italic;">"(cd share/backups/sv04; unlink last; ln -s ${DATETIME} last)"</span>
  <span style="font-weight: bold;">else</span>
    rsync -aAXrv --exclude-from=${<span style="font-weight: bold; font-style: italic;">HOME</span>}/.config/rsync/exclude_sv04.txt /mnt/sv04/ ${<span style="font-weight: bold; font-style: italic;">DEST</span>}/sv04/${<span style="font-weight: bold; font-style: italic;">DATETIME</span>}
    ssh ns01 <span style="font-style: italic;">"(cd share/backups/sv04; ln -s ${DATETIME} last)"</span>
  <span style="font-weight: bold;">fi</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div>
<ul class="org-ul">
<li><p>
rsync exclude file for pc01
</p>
<div class="org-src-container">
<pre class="src src-conf">+ var
+ var/log
+ var/log/**
- var/lib/dash
+ var/lib
+ var/lib/**
+ work
+ work/**
+ git
+ git/**
- *
</pre>
</div></li>
<li><p>
rsync exclude file for sv04
</p>
<div class="org-src-container">
<pre class="src src-conf">+ var
+ var/backup
+ var/backup/**
- *
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
