dotbins.html
<div id="outline-container-org587e947" class="outline-2">
<h2 id="org587e947">filetype</h2>
<div class="outline-text-2" id="text-org587e947">
<p>
This program determine type of the file.
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/env ruby</span>

<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'pathname'</span>
<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'uri'</span>
<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'shellwords'</span>

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">FileType</span>
  <span style="font-weight: bold; text-decoration: underline;">ZIP_PREFIXES</span> = [<span style="font-style: italic;">'Zip archive data'</span>]

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">type</span>(filename, file_cmd_opt = <span style="font-style: italic;">""</span>)
    <span style="font-weight: bold;">if</span>  <span style="font-weight: bold; text-decoration: underline;">File</span>.exists?(filename)
      local_opt = <span style="font-style: italic;">""</span>
      <span style="font-weight: bold;">if</span> <span style="font-weight: bold; text-decoration: underline;">File</span>.symlink?(filename)
        local_opt += <span style="font-style: italic;">"--dereference"</span>
      <span style="font-weight: bold;">end</span>
      <span style="font-style: italic;">`file --brief </span><span style="font-weight: bold; font-style: italic;">#{file_cmd_opt}</span><span style="font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">#{local_opt}</span><span style="font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">#{Shellwords.shellescape(filename)}</span><span style="font-style: italic;">`</span>.strip
    <span style="font-weight: bold;">elsif</span> filename =~ <span style="font-style: italic;">/https?:\/\/www\.youtube\.com.*/</span>
      <span style="font-style: italic;">`youtube-dl -f worst -q </span><span style="font-weight: bold; font-style: italic;">#{Shellwords.shellescape(filename)}</span><span style="font-style: italic;"> -o - 2&gt;/dev/null | file --brief </span><span style="font-weight: bold; font-style: italic;">#{file_cmd_opt}</span><span style="font-style: italic;"> -`</span>.strip
    <span style="font-weight: bold;">elsif</span> filename =~ <span style="font-weight: bold; text-decoration: underline;">URI</span>::<span style="font-weight: bold; text-decoration: underline;">DEFAULT_PARSER</span>.make_regexp
      <span style="font-style: italic;">`curl --location --range 0-9999 </span><span style="font-weight: bold; font-style: italic;">#{Shellwords.shellescape(filename)}</span><span style="font-style: italic;"> 2&gt;/dev/null | file --brief </span><span style="font-weight: bold; font-style: italic;">#{file_cmd_opt}</span><span style="font-style: italic;"> -`</span>.strip
    <span style="font-weight: bold;">else</span>
      <span style="font-style: italic;">''</span>
    <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">mime_type</span>(filename)
    type(filename, <span style="font-style: italic;">"--mime-type"</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">block_device?</span>(file)
    type(file).start_with?(<span style="font-style: italic;">'block special'</span>) &amp;&amp;
      mime_type(file) == <span style="font-style: italic;">'inode/blockdevice'</span>
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">iso9660?</span>(file)
    mime_type(file) == <span style="font-style: italic;">'application/x-iso9660-image'</span>
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">video_dvd_image?</span>(file)
    iso9660?(file) &amp;&amp; type(file).start_with?(<span style="font-style: italic;">'UDF filesystem data'</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">html?</span>(file)
    type(file).start_with?(<span style="font-style: italic;">"HTML document"</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">pdf?</span>(file)
    type(file).start_with?(<span style="font-style: italic;">"PDF document"</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">epub?</span>(file)
    type(file) == <span style="font-style: italic;">"EPUB document"</span>
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">mobi?</span>(file)
    type(file).start_with?(<span style="font-style: italic;">"Mobipocket E-book"</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">pgp?</span>(file)
    type(file).start_with?(<span style="font-style: italic;">"PGP"</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">tarpgp?</span>(file)
    pgp?(file) &amp;&amp; file.end_with?(<span style="font-style: italic;">'.tar.gpg'</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">zip?</span>(file)
    type(file).start_with?(*<span style="font-weight: bold; text-decoration: underline;">ZIP_PREFIXES</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">video?</span>(file)
    mime_type(file).start_with?(<span style="font-style: italic;">"video/"</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">audio?</span>(file)
    mime_type(file).start_with?(<span style="font-style: italic;">'audio/'</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">image?</span>(file)
    mime_type(file).start_with?(<span style="font-style: italic;">"image/"</span>)
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">playable?</span>(file)
    <span style="font-weight: bold;">if</span> <span style="font-weight: bold; text-decoration: underline;">File</span>.directory?(file)
      <span style="font-weight: bold; text-decoration: underline;">Dir</span>.foreach(file) <span style="font-weight: bold;">do</span> |fname|
        <span style="font-weight: bold;">next</span> <span style="font-weight: bold;">if</span> [<span style="font-style: italic;">"."</span>, <span style="font-style: italic;">".."</span>].include?(fname)
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">false</span> <span style="font-weight: bold;">unless</span> playable?(<span style="font-style: italic;">"</span><span style="font-weight: bold; font-style: italic;">#{file}</span><span style="font-style: italic;">/</span><span style="font-weight: bold; font-style: italic;">#{fname}</span><span style="font-style: italic;">"</span>)
      <span style="font-weight: bold;">end</span>
      <span style="font-weight: bold; text-decoration: underline;">true</span>
    <span style="font-weight: bold;">elsif</span> file =~ <span style="font-style: italic;">/https?:\/\/www\.youtube\.com.*/</span>
      <span style="font-weight: bold; text-decoration: underline;">true</span>
    <span style="font-weight: bold;">else</span>
      type(file).start_with?(<span style="font-style: italic;">"ISO Media"</span>, <span style="font-style: italic;">"Audio file"</span>) ||
        mime_type(file).start_with?(<span style="font-style: italic;">"video"</span>, <span style="font-style: italic;">"audio"</span>, <span style="font-style: italic;">"image"</span>)
    <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">end</span>

  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">dvd_dir?</span>(file)
    <span style="font-weight: bold; text-decoration: underline;">false</span> <span style="font-weight: bold;">unless</span> mime_type(file) == <span style="font-style: italic;">'inode/directory'</span>
    <span style="font-weight: bold; text-decoration: underline;">File</span>.exist?(<span style="font-weight: bold; text-decoration: underline;">Pathname</span>.new(file).join(<span style="font-style: italic;">"VIDEO_TS"</span>)) ||
      <span style="font-weight: bold; text-decoration: underline;">File</span>.exist?(<span style="font-weight: bold; text-decoration: underline;">Pathname</span>.new(file).join(<span style="font-style: italic;">"video_ts"</span>))
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
