dotbins.org
* genalbum

Personal script for encoding family pictures and movies.

#+begin_src ruby :tangle (expand-tangle-target ".local/bin/genalbum")
  #!/usr/bin/env ruby

  require 'fileutils'
  require 'time'
  require 'exifr'
  require 'streamio-ffmpeg'
  require 'pathname'
  require 'thor'

  PICTURE_FILE_EXTS = [".jpg"]
  MOVIE_FILE_EXTS = [".mp4"]
  ALBUM_DIR_NAME = "album/"
  RENAME_DIR_NAME = "rename/"
  WEB_DIR_NAME = "album_web/"
  IMG_PREFIX = "img_"

  class GenAlbum < Thor
    default_command :album
    desc "[album] -i <img_dir>", "generate album"
    option :in, aliases: "i", :type => :string, :required => true
    def album
      src_path = File.expand_path(options[:in], Dir.pwd)
      dest_path = ALBUM_DIR_NAME

      FileUtils.mkdir_p(dest_path) unless FileTest.exist?(dest_path)

      Dir.glob(src_path + "/*").each do |img_file|
        basename = File::basename(img_file)
        src_file = src_path + "/" + basename
        dest_file = dest_path + "/" + basename
        ext = File.extname(img_file)
        if PICTURE_FILE_EXTS.index(ext.downcase) != nil then
          system("convert -resize \"4096x>\" -quality 92 #{src_file} #{dest_file}")
        elsif MOVIE_FILE_EXTS.index(ext.downcase) != nil then
          system("mediautil encode -i #{src_file} -o #{dest_file} -q 22.0 -Q 100.0")
        end
      end
    end

    desc "web -i <img_dir>", "generate lightweight album for web"
    option :in, aliases: "i", :type => :string, :required => true
    def web
      src_path = File.expand_path(options[:in], Dir.pwd)
      dest_path = WEB_DIR_NAME

      FileUtils.mkdir_p(dest_path) unless FileTest.exist?(dest_path)

      Dir.glob(src_path + "/*").each do |img_file|
        basename = File::basename(img_file)
        src_file = src_path + "/" + basename
        dest_file = dest_path + "/" + basename
        ext = File.extname(img_file)
        if PICTURE_FILE_EXTS.index(ext.downcase) != nil then
          system("convert -resize \"1024x>\" -quality 80 #{src_file} #{dest_file}")
        elsif MOVIE_FILE_EXTS.index(ext.downcase) != nil then
          system("mediautil encode -i #{src_file} -o #{dest_file} -q 26.0 -Q 100.0")
        end
      end
    end

    desc "renmae -i <img_dir>", "rename image files in chlonological order"
    option :in, aliases: "i", :type => :string, :required => true
    option :out, aliases: "o", :type => :string
    def rename
      src_path = File.expand_path(options[:in], Dir.pwd)
      dest_path = ((options[:out]) ? options[:out] : RENAME_DIR_NAME)

      FileUtils.mkdir_p(dest_path) unless FileTest.exist?(dest_path)

      img_time = {}
      Dir.glob(src_path + "/*").each do |img_file|
        ext = File.extname(img_file)
        if PICTURE_FILE_EXTS.index(ext.downcase) != nil then
          pic = EXIFR::JPEG.new(img_file)
          if pic.exif? && pic.date_time_original then
            img_time[img_file] = pic.date_time_original
          else
            img_time[img_file] = Time.now
          end
        elsif MOVIE_FILE_EXTS.index(ext.downcase) != nil then
          movie = FFMPEG::Movie.new(img_file)
          time = movie.creation_time
          if time then
            img_time[img_file] = time
          else
            img_time[img_file] = Time.now
          end
        end
      end
      img_time = img_time.sort_by{ |_, v| v }

      digit = img_time.length.to_s.length
      digit = 2 if digit < 2
      img_time.each_with_index do |(img, time), i|
        ext = File.extname(img).downcase
        base = IMG_PREFIX + "%0#{digit}d" % (i + 1) + ext
        src_file = img
        dest_file = dest_path + "/" + base
        system("cp #{src_file} #{dest_file}")
      end
    end
  end

  GenAlbum.start(ARGV)
#+end_src

