dotbins.html
<div id="outline-container-org9996d96" class="outline-2">
<h2 id="org9996d96">genalbum</h2>
<div class="outline-text-2" id="text-org9996d96">
<p>
Personal script for encoding family pictures and movies.
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/env ruby</span>

<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'fileutils'</span>
<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'time'</span>
<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'exifr'</span>
<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'streamio-ffmpeg'</span>
<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'pathname'</span>
<span style="font-weight: bold;">require</span> <span style="font-style: italic;">'thor'</span>

<span style="font-weight: bold; text-decoration: underline;">PICTURE_FILE_EXTS</span> = [<span style="font-style: italic;">".jpg"</span>]
<span style="font-weight: bold; text-decoration: underline;">MOVIE_FILE_EXTS</span> = [<span style="font-style: italic;">".mp4"</span>]
<span style="font-weight: bold; text-decoration: underline;">ALBUM_DIR_NAME</span> = <span style="font-style: italic;">"album/"</span>
<span style="font-weight: bold; text-decoration: underline;">RENAME_DIR_NAME</span> = <span style="font-style: italic;">"rename/"</span>
<span style="font-weight: bold; text-decoration: underline;">WEB_DIR_NAME</span> = <span style="font-style: italic;">"album_web/"</span>
<span style="font-weight: bold; text-decoration: underline;">IMG_PREFIX</span> = <span style="font-style: italic;">"img_"</span>

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">GenAlbum</span> &lt; <span style="font-weight: bold; text-decoration: underline;">Thor</span>
  default_command <span style="font-weight: bold; text-decoration: underline;">:album</span>
  desc <span style="font-style: italic;">"[album] -i &lt;img_dir&gt;"</span>, <span style="font-style: italic;">"generate album"</span>
  option <span style="font-weight: bold; text-decoration: underline;">:in</span>, <span style="font-weight: bold; text-decoration: underline;">aliases:</span> <span style="font-style: italic;">"i"</span>, <span style="font-weight: bold; text-decoration: underline;">:type</span> =&gt; <span style="font-weight: bold; text-decoration: underline;">:string</span>, <span style="font-weight: bold; text-decoration: underline;">:required</span> =&gt; <span style="font-weight: bold; text-decoration: underline;">true</span>
  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">album</span>
    src_path = <span style="font-weight: bold; text-decoration: underline;">File</span>.expand_path(options[<span style="font-weight: bold; text-decoration: underline;">:in</span>], <span style="font-weight: bold; text-decoration: underline;">Dir</span>.pwd)
    dest_path = <span style="font-weight: bold; text-decoration: underline;">ALBUM_DIR_NAME</span>

    <span style="font-weight: bold; text-decoration: underline;">FileUtils</span>.mkdir_p(dest_path) <span style="font-weight: bold;">unless</span> <span style="font-weight: bold; text-decoration: underline;">FileTest</span>.exist?(dest_path)

    <span style="font-weight: bold; text-decoration: underline;">Dir</span>.glob(src_path + <span style="font-style: italic;">"/*"</span>).each <span style="font-weight: bold;">do</span> |img_file|
      basename = <span style="font-weight: bold; text-decoration: underline;">File</span>::basename(img_file)
      src_file = src_path + <span style="font-style: italic;">"/"</span> + basename
      dest_file = dest_path + <span style="font-style: italic;">"/"</span> + basename
      ext = <span style="font-weight: bold; text-decoration: underline;">File</span>.extname(img_file)
      <span style="font-weight: bold;">if</span> <span style="font-weight: bold; text-decoration: underline;">PICTURE_FILE_EXTS</span>.index(ext.downcase) != <span style="font-weight: bold; text-decoration: underline;">nil</span> <span style="font-weight: bold;">then</span>
        <span style="font-weight: bold;">system</span>(<span style="font-style: italic;">"convert -resize \"4096x&gt;\" -quality 92 </span><span style="font-weight: bold; font-style: italic;">#{src_file}</span><span style="font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">#{dest_file}</span><span style="font-style: italic;">"</span>)
      <span style="font-weight: bold;">elsif</span> <span style="font-weight: bold; text-decoration: underline;">MOVIE_FILE_EXTS</span>.index(ext.downcase) != <span style="font-weight: bold; text-decoration: underline;">nil</span> <span style="font-weight: bold;">then</span>
        <span style="font-weight: bold;">system</span>(<span style="font-style: italic;">"mediautil encode -i </span><span style="font-weight: bold; font-style: italic;">#{src_file}</span><span style="font-style: italic;"> -o </span><span style="font-weight: bold; font-style: italic;">#{dest_file}</span><span style="font-style: italic;"> -q 22.0 -Q 100.0"</span>)
      <span style="font-weight: bold;">end</span>
    <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">end</span>

  desc <span style="font-style: italic;">"web -i &lt;img_dir&gt;"</span>, <span style="font-style: italic;">"generate lightweight album for web"</span>
  option <span style="font-weight: bold; text-decoration: underline;">:in</span>, <span style="font-weight: bold; text-decoration: underline;">aliases:</span> <span style="font-style: italic;">"i"</span>, <span style="font-weight: bold; text-decoration: underline;">:type</span> =&gt; <span style="font-weight: bold; text-decoration: underline;">:string</span>, <span style="font-weight: bold; text-decoration: underline;">:required</span> =&gt; <span style="font-weight: bold; text-decoration: underline;">true</span>
  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">web</span>
    src_path = <span style="font-weight: bold; text-decoration: underline;">File</span>.expand_path(options[<span style="font-weight: bold; text-decoration: underline;">:in</span>], <span style="font-weight: bold; text-decoration: underline;">Dir</span>.pwd)
    dest_path = <span style="font-weight: bold; text-decoration: underline;">WEB_DIR_NAME</span>

    <span style="font-weight: bold; text-decoration: underline;">FileUtils</span>.mkdir_p(dest_path) <span style="font-weight: bold;">unless</span> <span style="font-weight: bold; text-decoration: underline;">FileTest</span>.exist?(dest_path)

    <span style="font-weight: bold; text-decoration: underline;">Dir</span>.glob(src_path + <span style="font-style: italic;">"/*"</span>).each <span style="font-weight: bold;">do</span> |img_file|
      basename = <span style="font-weight: bold; text-decoration: underline;">File</span>::basename(img_file)
      src_file = src_path + <span style="font-style: italic;">"/"</span> + basename
      dest_file = dest_path + <span style="font-style: italic;">"/"</span> + basename
      ext = <span style="font-weight: bold; text-decoration: underline;">File</span>.extname(img_file)
      <span style="font-weight: bold;">if</span> <span style="font-weight: bold; text-decoration: underline;">PICTURE_FILE_EXTS</span>.index(ext.downcase) != <span style="font-weight: bold; text-decoration: underline;">nil</span> <span style="font-weight: bold;">then</span>
        <span style="font-weight: bold;">system</span>(<span style="font-style: italic;">"convert -resize \"1024x&gt;\" -quality 80 </span><span style="font-weight: bold; font-style: italic;">#{src_file}</span><span style="font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">#{dest_file}</span><span style="font-style: italic;">"</span>)
      <span style="font-weight: bold;">elsif</span> <span style="font-weight: bold; text-decoration: underline;">MOVIE_FILE_EXTS</span>.index(ext.downcase) != <span style="font-weight: bold; text-decoration: underline;">nil</span> <span style="font-weight: bold;">then</span>
        <span style="font-weight: bold;">system</span>(<span style="font-style: italic;">"mediautil encode -i </span><span style="font-weight: bold; font-style: italic;">#{src_file}</span><span style="font-style: italic;"> -o </span><span style="font-weight: bold; font-style: italic;">#{dest_file}</span><span style="font-style: italic;"> -q 26.0 -Q 100.0"</span>)
      <span style="font-weight: bold;">end</span>
    <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">end</span>

  desc <span style="font-style: italic;">"renmae -i &lt;img_dir&gt;"</span>, <span style="font-style: italic;">"rename image files in chlonological order"</span>
  option <span style="font-weight: bold; text-decoration: underline;">:in</span>, <span style="font-weight: bold; text-decoration: underline;">aliases:</span> <span style="font-style: italic;">"i"</span>, <span style="font-weight: bold; text-decoration: underline;">:type</span> =&gt; <span style="font-weight: bold; text-decoration: underline;">:string</span>, <span style="font-weight: bold; text-decoration: underline;">:required</span> =&gt; <span style="font-weight: bold; text-decoration: underline;">true</span>
  option <span style="font-weight: bold; text-decoration: underline;">:out</span>, <span style="font-weight: bold; text-decoration: underline;">aliases:</span> <span style="font-style: italic;">"o"</span>, <span style="font-weight: bold; text-decoration: underline;">:type</span> =&gt; <span style="font-weight: bold; text-decoration: underline;">:string</span>
  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">rename</span>
    src_path = <span style="font-weight: bold; text-decoration: underline;">File</span>.expand_path(options[<span style="font-weight: bold; text-decoration: underline;">:in</span>], <span style="font-weight: bold; text-decoration: underline;">Dir</span>.pwd)
    dest_path = ((options[<span style="font-weight: bold; text-decoration: underline;">:out</span>]) ? options[<span style="font-weight: bold; text-decoration: underline;">:out</span>] : <span style="font-weight: bold; text-decoration: underline;">RENAME_DIR_NAME</span>)

    <span style="font-weight: bold; text-decoration: underline;">FileUtils</span>.mkdir_p(dest_path) <span style="font-weight: bold;">unless</span> <span style="font-weight: bold; text-decoration: underline;">FileTest</span>.exist?(dest_path)

    img_time = {}
    <span style="font-weight: bold; text-decoration: underline;">Dir</span>.glob(src_path + <span style="font-style: italic;">"/*"</span>).each <span style="font-weight: bold;">do</span> |img_file|
      ext = <span style="font-weight: bold; text-decoration: underline;">File</span>.extname(img_file)
      <span style="font-weight: bold;">if</span> <span style="font-weight: bold; text-decoration: underline;">PICTURE_FILE_EXTS</span>.index(ext.downcase) != <span style="font-weight: bold; text-decoration: underline;">nil</span> <span style="font-weight: bold;">then</span>
        pic = <span style="font-weight: bold; text-decoration: underline;">EXIFR</span>::<span style="font-weight: bold; text-decoration: underline;">JPEG</span>.new(img_file)
        <span style="font-weight: bold;">if</span> pic.exif? &amp;&amp; pic.date_time_original <span style="font-weight: bold;">then</span>
          img_time[img_file] = pic.date_time_original
        <span style="font-weight: bold;">else</span>
          img_time[img_file] = <span style="font-weight: bold; text-decoration: underline;">Time</span>.now
        <span style="font-weight: bold;">end</span>
      <span style="font-weight: bold;">elsif</span> <span style="font-weight: bold; text-decoration: underline;">MOVIE_FILE_EXTS</span>.index(ext.downcase) != <span style="font-weight: bold; text-decoration: underline;">nil</span> <span style="font-weight: bold;">then</span>
        movie = <span style="font-weight: bold; text-decoration: underline;">FFMPEG</span>::<span style="font-weight: bold; text-decoration: underline;">Movie</span>.new(img_file)
        time = movie.creation_time
        <span style="font-weight: bold;">if</span> time <span style="font-weight: bold;">then</span>
          img_time[img_file] = time
        <span style="font-weight: bold;">else</span>
          img_time[img_file] = <span style="font-weight: bold; text-decoration: underline;">Time</span>.now
        <span style="font-weight: bold;">end</span>
      <span style="font-weight: bold;">end</span>
    <span style="font-weight: bold;">end</span>
    img_time = img_time.sort_by{ |_, v| v }

    digit = img_time.length.to_s.length
    digit = 2 <span style="font-weight: bold;">if</span> digit &lt; 2
    img_time.each_with_index <span style="font-weight: bold;">do</span> |(img, time), i|
      ext = <span style="font-weight: bold; text-decoration: underline;">File</span>.extname(img).downcase
      base = <span style="font-weight: bold; text-decoration: underline;">IMG_PREFIX</span> + <span style="font-style: italic;">"%0</span><span style="font-weight: bold; font-style: italic;">#{digit}</span><span style="font-style: italic;">d"</span> % (i + 1) + ext
      src_file = img
      dest_file = dest_path + <span style="font-style: italic;">"/"</span> + base
      <span style="font-weight: bold;">system</span>(<span style="font-style: italic;">"cp </span><span style="font-weight: bold; font-style: italic;">#{src_file}</span><span style="font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">#{dest_file}</span><span style="font-style: italic;">"</span>)
    <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>

<span style="font-weight: bold; text-decoration: underline;">GenAlbum</span>.start(<span style="font-weight: bold; text-decoration: underline;">ARGV</span>)
</pre>
</div>
</div>
</div>
