dotbins.html

<div id="outline-container-orgd76e9f1" class="outline-2">
<h2 id="orgd76e9f1">nhp</h2>
<div class="outline-text-2" id="text-orgd76e9f1">
<p>
Exec command in background
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>

<span style="font-weight: bold;">readonly</span> <span style="font-weight: bold; font-style: italic;">MAIL_FROM</span>=<span style="font-style: italic;">"&lt;&lt;email()&gt;&gt;"</span>
<span style="font-weight: bold;">readonly</span> <span style="font-weight: bold; font-style: italic;">MAIL_TO</span>=<span style="font-style: italic;">"&lt;&lt;email()&gt;&gt;"</span>

<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">usage</span>() {
  cat &lt;&lt;_EOT_
<span style="font-weight: bold;">Usage:</span>
<span style="font-weight: bold;">  $(basename "$0") [options] command|exefile</span>

<span style="font-weight: bold;">Description:</span>
<span style="font-weight: bold;">  $(basename "$0") executes command(s) in back-ground process continueing after the user logs out</span>

<span style="font-weight: bold;">Options:</span>
<span style="font-weight: bold;">  -l &lt;logfile&gt;  log file name</span>
<span style="font-weight: bold;">  -p &lt;pidfile&gt;  process id file name</span>
<span style="font-weight: bold;">  -h            help</span>

<span style="font-weight: bold;">_EOT_</span>
  <span style="font-weight: bold;">exit</span> 1
}

<span style="font-weight: bold;">if</span> [ <span style="font-style: italic;">"${OPTIND}"</span> = 1 ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold;">while </span><span style="font-weight: bold;">getopts</span> l:p:h OPT
  <span style="font-weight: bold;">do</span>
    <span style="font-weight: bold;">case</span> ${<span style="font-weight: bold; font-style: italic;">OPT</span>} <span style="font-weight: bold;">in</span>
    l)
      <span style="font-weight: bold; font-style: italic;">opt_logfile</span>=${<span style="font-weight: bold; font-style: italic;">OPTARG</span>}
      ;;
    p)
      <span style="font-weight: bold; font-style: italic;">opt_pidfile</span>=${<span style="font-weight: bold; font-style: italic;">OPTARG</span>}
      ;;
    h)
      usage
      ;;
    <span style="font-style: italic;">\?</span>)
      <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Try to enter the h option."</span> 1&gt;&amp;2
      ;;
    <span style="font-weight: bold;">esac</span>
  <span style="font-weight: bold;">done</span>
<span style="font-weight: bold;">else</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"No installed getopts-command."</span> 1&gt;&amp;2
  <span style="font-weight: bold;">exit</span> 1
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold;">shift</span> $((OPTIND - 1))

<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">mailtome</span>() {
  local <span style="font-weight: bold; font-style: italic;">_command</span>=$<span style="font-weight: bold; font-style: italic;">1</span>
  local <span style="font-weight: bold; font-style: italic;">_whole_command</span>=$<span style="font-weight: bold; font-style: italic;">2</span>
  local <span style="font-weight: bold; font-style: italic;">_logfile_rel</span>=$<span style="font-weight: bold; font-style: italic;">4</span>

  <span style="font-weight: bold;">if</span> [ <span style="font-style: italic;">"$3"</span> -eq 0 ]; <span style="font-weight: bold;">then</span>
    <span style="font-weight: bold; font-style: italic;">_result</span>=<span style="font-style: italic;">'success'</span>
  <span style="font-weight: bold;">else</span>
    <span style="font-weight: bold; font-style: italic;">_result</span>=<span style="font-style: italic;">'failed'</span>
  <span style="font-weight: bold;">fi</span>
  <span style="font-weight: bold; font-style: italic;">_logfile</span>=$(<span style="font-weight: bold;">type</span> realpath &gt;/dev/null &amp;&amp; realpath <span style="font-style: italic;">"${_logfile_rel}"</span> || <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${_logfile_rel}"</span>)

  <span style="font-weight: bold; font-style: italic;">mailfrom</span>=${<span style="font-weight: bold; font-style: italic;">MAIL_FROM</span>}
  <span style="font-weight: bold; font-style: italic;">mailto</span>=${<span style="font-weight: bold; font-style: italic;">MAIL_TO</span>}
  <span style="font-weight: bold; font-style: italic;">subject</span>=<span style="font-style: italic;">"${_result}: ${_command} @ $(uname -n)"</span>
  <span style="font-weight: bold; font-style: italic;">msg1</span>=<span style="font-style: italic;">"command line      : ${_whole_command}"</span>
  <span style="font-weight: bold; font-style: italic;">msg2</span>=<span style="font-style: italic;">"exit status(nohup): $3"</span>
  <span style="font-weight: bold; font-style: italic;">msg3</span>=<span style="font-style: italic;">"execution time    : $5"</span>
  <span style="font-weight: bold; font-style: italic;">msg4</span>=<span style="font-style: italic;">"pwd               : $(pwd)"</span>
  <span style="font-weight: bold; font-style: italic;">msg5</span>=<span style="font-style: italic;">"Log data (stdout/stderr) is stored in following file:"</span>
  <span style="font-weight: bold; font-style: italic;">msg6</span>=<span style="font-style: italic;">"${_logfile}"</span>

  {
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${msg1}"</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${msg2}"</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${msg3}"</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${msg4}"</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${msg5}"</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${msg6}"</span>
  } | sendmail.py -f <span style="font-style: italic;">"${mailfrom}"</span> -s <span style="font-style: italic;">"${subject}"</span> <span style="font-style: italic;">"${mailto}"</span>
}
<span style="font-weight: bold;">export</span> -f mailtome

<span style="font-weight: bold;">if</span> [ $<span style="font-weight: bold; font-style: italic;">#</span> -eq 1 ] &amp;&amp; [ -x <span style="font-style: italic;">"$1"</span> ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold; font-style: italic;">utility</span>=<span style="font-style: italic;">"$1"</span>
<span style="font-weight: bold;">elif</span> [ $<span style="font-weight: bold; font-style: italic;">#</span> -gt 0 ] &amp;&amp; <span style="font-weight: bold;">type</span> <span style="font-style: italic;">"$1"</span> &gt;/dev/null; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold; font-style: italic;">utility</span>=<span style="font-style: italic;">"$*"</span>
<span style="font-weight: bold;">else</span>
  <span style="font-weight: bold;">exit</span> 1
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold; font-style: italic;">LOG_DIR</span>=${<span style="font-weight: bold; font-style: italic;">HOME</span>}/var/log/$(basename <span style="font-style: italic;">"$0"</span>)
<span style="font-weight: bold; font-style: italic;">fname_default</span>=$(date <span style="font-style: italic;">'+%Y%m%d_%H%M%S'</span>)_$(basename <span style="font-style: italic;">"$0"</span>)-$(basename <span style="font-style: italic;">"$1"</span>)

<span style="font-weight: bold;">if</span> [ ! -d <span style="font-style: italic;">"${LOG_DIR}"</span> ]; <span style="font-weight: bold;">then</span>
  mkdir -p <span style="font-style: italic;">"${LOG_DIR}"</span>
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold;">if</span> [ -v <span style="font-style: italic;">"opt_logfile"</span> ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold; font-style: italic;">logfile</span>=${<span style="font-weight: bold; font-style: italic;">opt_logfile</span>}
<span style="font-weight: bold;">else</span>
  <span style="font-weight: bold; font-style: italic;">logfile</span>=<span style="font-style: italic;">"${LOG_DIR}/${fname_default}.log"</span>
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold;">if</span> [ -v <span style="font-style: italic;">"opt_pidfile"</span> ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold; font-style: italic;">pidfile</span>=${<span style="font-weight: bold; font-style: italic;">opt_pidfile</span>}
<span style="font-weight: bold;">else</span>
  <span style="font-weight: bold; font-style: italic;">pidfile</span>=<span style="font-style: italic;">"${LOG_DIR}/${fname_default}.pid"</span>
<span style="font-weight: bold;">fi</span>

(
  <span style="font-weight: bold; font-style: italic;">start_time</span>=$(date +%s)
  nohup nice -n 10 ${<span style="font-weight: bold; font-style: italic;">utility</span>} &gt;&gt;<span style="font-style: italic;">"${logfile}"</span> &lt;/dev/null 2&gt;&amp;1 &amp;
  <span style="font-weight: bold; font-style: italic;">PID</span>=$<span style="font-weight: bold; font-style: italic;">!</span>
  <span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">PID</span> &gt;<span style="font-style: italic;">"${pidfile}"</span>
  <span style="font-weight: bold;">wait</span> $<span style="font-weight: bold; font-style: italic;">PID</span>
  <span style="font-weight: bold; font-style: italic;">EXIT_STATUS</span>=$<span style="font-weight: bold; font-style: italic;">?</span>
  <span style="font-weight: bold; font-style: italic;">end_time</span>=$(date +%s)
  <span style="font-weight: bold; font-style: italic;">exec_time</span>=$((end_time-start_time))
  ((<span style="font-weight: bold; font-style: italic;">h</span>=exec_time/3600))
  ((<span style="font-weight: bold; font-style: italic;">m</span>=(exec_time%3600)/60))
  ((<span style="font-weight: bold; font-style: italic;">s</span>=exec_time%60))
  <span style="font-weight: bold; font-style: italic;">exec_time_str</span>=$(printf <span style="font-style: italic;">"%02d:%02d:%02d"</span> $<span style="font-weight: bold; font-style: italic;">h</span> $<span style="font-weight: bold; font-style: italic;">m</span> $<span style="font-weight: bold; font-style: italic;">s</span>)
  mailtome <span style="font-style: italic;">"$1"</span> <span style="font-style: italic;">"${utility}"</span> $<span style="font-weight: bold; font-style: italic;">EXIT_STATUS</span> <span style="font-style: italic;">"${logfile}"</span> ${<span style="font-weight: bold; font-style: italic;">exec_time_str</span>}
)
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$1 has finished successfully"</span>

<span style="font-weight: bold;">exit</span> 0
</pre>
</div>
</div>
</div>
