dotbins.html

<div id="outline-container-org2bbb8e2" class="outline-2">
<h2 id="org2bbb8e2">sendmail.py</h2>
<div class="outline-text-2" id="text-org2bbb8e2">
<p>
Utility for sendind email programatically
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/env python3</span>

<span style="font-weight: bold;">import</span> sys
<span style="font-weight: bold;">import</span> argparse
<span style="font-weight: bold;">import</span> subprocess
<span style="font-weight: bold;">import</span> smtplib
<span style="font-weight: bold;">import</span> ssl
<span style="font-weight: bold;">from</span> email.mime.text <span style="font-weight: bold;">import</span> MIMEText
<span style="font-weight: bold;">from</span> email.utils <span style="font-weight: bold;">import</span> formatdate

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sendmail</span>(mail_to, mail_from, subject, message):
    <span style="font-weight: bold; font-style: italic;">smtp_host</span> = <span style="font-style: italic;">'smtp.daisychain.jp'</span>
    <span style="font-weight: bold; font-style: italic;">smtp_port</span> = <span style="font-style: italic;">'465'</span>
    <span style="font-weight: bold; font-style: italic;">smtp_user</span> = <span style="font-style: italic;">'&lt;&lt;email()&gt;&gt;'</span>.split(sep=<span style="font-style: italic;">'@'</span>)[0]
    <span style="font-weight: bold; font-style: italic;">smtp_pass</span> = subprocess.run([<span style="font-style: italic;">"pass {}:{}/{} | head -1"</span>.<span style="font-weight: bold;">format</span>(smtp_host, smtp_port, smtp_user)], stdout=subprocess.PIPE, shell=<span style="font-weight: bold; text-decoration: underline;">True</span>).stdout.decode().strip()

    <span style="font-weight: bold; font-style: italic;">mime_msg</span> = MIMEText(message)
    <span style="font-weight: bold; font-style: italic;">mime_msg</span>[<span style="font-style: italic;">'Subject'</span>] = subject
    <span style="font-weight: bold; font-style: italic;">mime_msg</span>[<span style="font-style: italic;">'From'</span>] = mail_from
    <span style="font-weight: bold; font-style: italic;">mime_msg</span>[<span style="font-style: italic;">'To'</span>] = mail_to
    <span style="font-weight: bold; font-style: italic;">mime_msg</span>[<span style="font-style: italic;">"Date"</span>] = formatdate(<span style="font-weight: bold; text-decoration: underline;">None</span>, <span style="font-weight: bold; text-decoration: underline;">True</span>)

    <span style="font-weight: bold;">if</span> smtp_port == <span style="font-style: italic;">'465'</span>:
        <span style="font-weight: bold; font-style: italic;">context</span> = ssl.create_default_context()
        <span style="font-weight: bold; font-style: italic;">smtp</span> = smtplib.SMTP_SSL(smtp_host, smtp_port, context=context)

    <span style="font-weight: bold;">if</span> smtp <span style="font-weight: bold;">is</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
        smtp.login(smtp_user, smtp_pass)
        smtp.sendmail(mail_from, mail_to, mime_msg.as_string())
        smtp.<span style="font-weight: bold; text-decoration: underline;">quit</span>()


<span style="font-weight: bold; font-style: italic;">DESC</span> = <span style="font-style: italic;">'sendmail.py sends mail'</span>
<span style="font-weight: bold; font-style: italic;">parser</span> = argparse.ArgumentParser(description=DESC)
parser.add_argument(<span style="font-style: italic;">'-s'</span>, <span style="font-style: italic;">'--subject'</span>)
parser.add_argument(<span style="font-style: italic;">'-f'</span>, <span style="font-style: italic;">'--mailfrom'</span>)
parser.add_argument(<span style="font-style: italic;">'to'</span>)
<span style="font-weight: bold; font-style: italic;">args</span> = parser.parse_args()

<span style="font-weight: bold; font-style: italic;">message</span> = sys.stdin.read()
sendmail(args.to, args.mailfrom, args.subject, message)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7633708" class="outline-2">
<h2 id="org7633708">pwsudo</h2>
<div class="outline-text-2" id="text-org7633708">
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>

<span style="font-weight: bold; font-style: italic;">_userid</span>=$(whoami)
<span style="font-weight: bold; font-style: italic;">_hostname</span>=$(hostname)

<span style="font-weight: bold;">if</span> pass show <span style="font-style: italic;">"${_hostname}/${_userid}"</span> &gt;/dev/null 2&gt;&amp;1; <span style="font-weight: bold;">then</span>
  pass show <span style="font-style: italic;">"${_hostname}/${_userid}"</span> | head -1 | sudo -S $<span style="font-weight: bold; font-style: italic;">*</span>
<span style="font-weight: bold;">else</span>
  sudo $<span style="font-weight: bold; font-style: italic;">*</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
